app/controllers/api/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def current_user
        @current_user ||= User.find_by(id: doorkeeper_token[:resource_owner_id])