app/controllers/api/data_aggregation_controller.rb

        def fetch_aggregation_result
            uploaded_file = current_user.uploaded_files.last
            records = UserCsvRecord.where(uploaded_file_id: uploaded_file.id)
---
SELECT "uploaded_files".* FROM "uploaded_files" WHERE "uploaded_files"."user_id" = $1 ORDER BY "uploaded_files"."id" DESC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT "user_csv_records".* FROM "user_csv_records" WHERE "user_csv_records"."uploaded_file_id" = $1 LIMIT $2  [["uploaded_file_id", 12], ["LIMIT", 11]]

        def generate_pdf_file(uploadedFile,data)
            file_name = "generated_report_"+uploadedFile.id.to_s+".pdf"
            save_path = Rails.root.join('public',file_name)
            Prawn::Document.generate(save_path) do
              text "Max Value: #{data[:maxValue]}"
              text "Median: #{data[:median]}"
              text "Time Series(Day wise): #{data[:dayWiseTimeSeries]}"
              text "Time Series(Month wise): #{data[:monthWiseTimeSeries]}"
            end
            obj = S3_BUCKET.objects[file_name]
            obj.write(file: save_path,acl: :public_read)
            pdf_url = "https://synapticproject.s3.amazonaws.com/#{file_name}"
            File.delete(save_path)
            uploadedFile.update(s3_file_path: pdf_url)
---
UPDATE "uploaded_files" SET "updated_at" = $1, "s3_file_path" = $2 WHERE "uploaded_files"."id" = $3  [["updated_at", "2022-06-13 08:06:39.433748"], ["s3_file_path", "https://synapticproject.s3.amazonaws.com/generated_report_1.pdf"], ["id", 1]]

        def share_result
            email_regex = /\A[\w+\-.]+@[a-z\d\-]+(\.[a-z]+)*\.[a-z]+\z/i
            isValid = params[:to_email] =~ email_regex
            if params[:to_email].present? && !isValid.nil?
                pdf_url = current_user.uploaded_files.last.s3_file_path
---
SELECT "uploaded_files".* FROM "uploaded_files" WHERE "uploaded_files"."user_id" = $1 ORDER BY "uploaded_files"."id" DESC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]