app/controllers/api/user_register_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
INSERT INTO "oauth_access_tokens" ("resource_owner_id", "application_id", "token", "refresh_token", "expires_in", "created_at", "scopes") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
        def create
          user = User.new(email: user_params[:email], password: user_params[:password])

          client_app = Doorkeeper::Application.find_by(uid: params[:client_id])

          return render(json: { error: 'Invalid client ID'}, status: 403) unless client_app

          if user.save
            # create access token for the user, so the user won't need to login again after registration
            access_token = Doorkeeper::AccessToken.create(
              resource_owner_id: user.id,
              application_id: client_app.id,
              refresh_token: generate_refresh_token,
              expires_in: Doorkeeper.configuration.access_token_expires_in.to_i,
              scopes: ''
            )

SELECT 1 AS one FROM "oauth_access_tokens" WHERE "oauth_access_tokens"."refresh_token" = $1 LIMIT $2  [["refresh_token", "44a4c03f9322a97a4a916387708b6128aec03a82ed0ba13c014e88ac40eb5a44"], ["LIMIT", 1]]
---
        def generate_refresh_token
          loop do
            # generate a random token string and return it,
            # unless there is already another token with the same string
            token = SecureRandom.hex(32)
            break token unless Doorkeeper::AccessToken.exists?(refresh_token: token)