app/controllers/api/user_csv_record_controller.rb

SELECT "uploaded_files".* FROM "uploaded_files" WHERE "uploaded_files"."user_id" = $1 ORDER BY "uploaded_files"."id" DESC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT "user_csv_records".* FROM "user_csv_records" WHERE "user_csv_records"."uploaded_file_id" = $1 LIMIT $2  [["uploaded_file_id", 10], ["LIMIT", 11]]
---
        def export
            uploaded_file = current_user.uploaded_files.last
            @csv_records = UserCsvRecord.where(uploaded_file_id: uploaded_file.id)