app/models/uploaded_file.rb

INSERT INTO "uploaded_files" ("file_name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["file_name", "sample - Sheet1.csv"], ["user_id", 1], ["created_at", "2022-06-12 07:05:38.966226"], ["updated_at", "2022-06-12 07:05:38.966226"]]
---
    def self.add_file(fileName,userId)
        UploadedFile.create!(file_name: fileName,user_id: userId)