app/models/user_csv_record.rb

SELECT "user_csv_records".* FROM "user_csv_records" WHERE "user_csv_records"."user_id" = $1  [["user_id", 1]]
---
    def self.import(file,current_user,uploadedFileId)
        csv_items = Hash.new
        index=0
        keys=[]
        csv_data_list=[]
        csv_data=Hash.new
        CSV.foreach(file.path) do |row|
            if index == 0
                keys=row
                index=index+1
            else
                keys.each_with_index.map { |x,i|

INSERT INTO "user_csv_records" ("date", "value", "domain_name", "user_id", "created_at", "updated_at", "uploaded_file_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
                    user_record.value = data["value"]
                    user_record.domain_name = data["domain_name"]
                    user_record.uploaded_file_id = data["uploaded_file_id"]
                    user_record.save!